Repository: rpeyron/xmltreenav
Catalog: po/*.po
Languages: fr

source: Apply
fr: Appliquer

source: Cancel
fr: Annuler

source: XSLT Local Display File to use
fr: Aperçu XSLT à utiliser

source: XSLT HTML Display File to use
fr: Aperçu XSLT HTML à utiliser

source: Config File to use
fr: Fichier de configuration à utiliser

source: XML File to open
fr: Fichier XML à ouvrir

source: Performs efficient XML tree navigation and diff XML files.
fr: Permet de naviguer efficacement dans les fichiers XML et une comparaison facile entre deux fichiers XML.

source: XML Files (*.xml)|*.xml|All files (*.*)|*.*
fr: Fichiers XML (*.xml)|*.xml|Tous les fichiers (*.*)|*.*

source: XSL Files (*.xsl;*.xslt)|*.xsl;*.xslt|All files (*.*)|*.*
fr: Fichiers XSL -*.xsl;*.xslt)|*.xsl;*.xslt|Tous les fichiers (*.*)|*.*

source: This function is not yet implemented, or is being developped.
fr: Cette fonction n'est pas pour l'instant développée, ou est en cours de développement.

source: Function not implemented.
fr: Fonction non développée.

source: Diff Options
fr: Options de comparaison

source: xmlDiff current file
fr: Compare le fichier XML avec celui en cours

source: With
fr: Avec

source: ...as Before file
fr: ... comme fichier Avant

source: ... as After file
fr: ... comme fichier Après

source: Identifiers
fr: Identifiants

source: Ignore Tags
fr: Ignorer les Noeuds

source: Add before values
fr: Ajout des valeurs précédentes

source: Separator
fr: Séparateur

source: Tag Childs
fr: Marque les noeuds fils

source: &Diff !
fr: &Comparer !

source: &Cancel
fr: &Annuler

source: Diff to current XML File
fr: Compare avec le fichier XML en cours

source: Diff the currently opened XML file with this file.
fr: Compare le fichier XML actuellement ouvert avec ce fichier.

source: Use the file specified above as before file, and the currently opened file as after file.
fr: Utilise le fichier spécifié ci-dessous comme fichier Avant, et le fichier actuellement ouvert comme fichier Après.

source: Use the file specified above as after file, and the currently opened file as before file.
fr: Utilise le fichier spécifié ci--dessous comme fichier Après, et le fichier actuellement ouvert comme fichier Avant.

source: Use these items as identifiers. (List of items separated by comma, attributes must be prefixed by @, and '.' can be used for the text)
fr: Utilise ces éléments comme identifiants. (Liste d'éléments séparés par des virgules, les attributs doivent être préfixés par @, et '.' désigne le texte du noeud)

source: Differences on these items will be ignored
fr: Les différences sur ces éléments seront ignorées

source: If checked, when a difference occurs, the output file will contain "before value <separator> after value"
fr: Lorsque cette option est cochée, en cas de différence, le fichier de sortie contiendra <valeur avant> <separateur> <valeur après>

source: Text to separate before and after values
fr: Texte séparant les valeurs Avant et Après

source: Recursively tag childs of added or deleted nodes.
fr: Marque les noeuds fils des noeuds ajoutés ou supprimés.

source: Open a file
fr: Ouvrir un fichier

source: XML File With '%s' does not exist
fr: Le fichier XML Avec '%s' n'existe pas

source: xmlDiff two files
fr: Compare deux fichiers XML

source: Before
fr: Avant

source: After
fr: Après

source: Diff Two XML Files
fr: Compare deux fichiers XML

source: XML File Before '%s' does not exist
fr: Le fichier XML Avant '%s' n'existe pas

source: XML File After '%s' does not exist
fr: Le fichier XML Après '%s' n'existe pas

source: Preferences
fr: Préférences

source: Clean Text
fr: Nettoyage du texte

source: Enforce Cleaning
fr: Force le nettoyage

source: Pretty Print on Save
fr: Sauvegarde un XML indenté

source: Engine
fr: Moteur

source: Optimize Memory usage
fr: Optimise l'utilisation mémoire

source: Use EXSLT
fr: Permettre EXSLT

source: Config
fr: Configuration

source: Configuration File
fr: Fichier de configuration

source: Search Size
fr: Taille de la recherche

source: Diff Defaults
fr: Par défaut

source: Identifiers
fr: Identifiants

source: Separator
fr: Séparateur

source: Tag childs
fr: Marque les noeuds fils

source: Special Node Ids
fr: Utiliser le contenu comme identifiant des nœuds spéciaux

source: Special Nodes Before Value
fr: Afficher les valeurs précédentes des nœuds spéciaux

source: &Open...
fr: &Ouvrir...

source: Open a file.
fr: Ouvre un fichier.

source: &Open and Diff...
fr: Ouvrir et &Comparer...

source: Open and diff two XML files.
fr: Ouvre deux fichiers et les compare entre eux.

source: &Save
fr: &Enregistre

source: Save the current file.
fr: Enregistre le fichier en cours.

source: &Save as...
fr: En&registre sous...

source: Save the current file under another name.
fr: Enregistre le fichier courant sous un autre nom.

source: &Reload
fr: Re&charge

source: Reload original file.
fr: Recharge le fichier tel qu'il était lors du dernier enregistrement.

source: &Preferences
fr: &Préférences

source: Define application's settings.
fr: Définit les réglages de l'application.

source: &Quit
fr: &Quitter

source: Quit the application.
fr: Quitte l'application.

source: &File
fr: &Fichier

source: &Copy
fr: &Copier

source: Copy current node to clipboard.
fr: Copier le noeud en cours dans le presse-papier.

source: &Paste
fr: &Coller

source: Paste to file.
fr: Coller le fichier.

source: &Search...
fr: &Recherche...

source: Search nodes with XPath expression.
fr: Recherche selon une expression XPath.

source: &Next
fr: &Suivant

source: Next node of the previous search.
fr: Affiche le prochain résultat de la dernière recherche.

source: &Expand All
fr: Tout d&éplier

source: Expand all nodes of selected item.
fr: Déplie tous les nœuds de l'élément sélectionné.

source: Co&llapse All
fr: Tout rep&lier

source: Collapse all nodes of selected item.
fr: Replie tous les nœuds de l'élément sélectionné.

source: &Edit
fr: &Edition

source: &Normal
fr: Standard

source: Normal display, with attributes and text inline.
fr: Affichage standard.

source: &Texts
fr: &Textes

source: Display with attributes inline, and texts as elements.
fr: Affiche les textes comme des élements.

source: &Full
fr: &Tous éléments

source: Display everything as elements.
fr: Affiche attributs et textes comme des éléments.

source: &Open Local XSLT Display...
fr: Aperçu XSLT...

source: Open a XSLT Local Display file.
fr: Ouvre un fichier XSLT pour afficher un aperçu de chaque noeud.

source: &Open HTML XSLT Display...
fr: Aperçu XSLT HTML...

source: Open a XSLT HTML Display file.
fr: Ouvre un fichier XSLT pour afficher un aperçu HTML de chaque noeud.

source: &Display
fr: &Affichage

source: &Diff to...
fr: &Compare à ...

source: Diff current XML file to another file.
fr: Compare le fichier XML actuellement ouvert avec ce fichier.

source: &Show differences
fr: &Montre les différences

source: Highlight differents elements.
fr: Affiche des icônes pour symboliser les différences.

source: Show &only differences
fr: &Uniquement les différences

source: Show only elements with differences.
fr: Montre uniquement les éléments différents.

source: &Diff
fr: &Comparaison

source: Help...
fr: &Aide...

source: Main help file.
fr: Ouvre le fichier d'aide.

source: Diff &icon's significations...
fr: Légende des icônes...

source: Explains diff icons.
fr: Explique les différentes icônes possibles et notamment concernant les statuts de différence XML.

source: Quick &XPath reference...
fr: Aide sur &XPath...

source: XPath reference URLs.
fr: Aide XPath.

source: &About...
fr: &A Propos...

source: About this application.
fr: A Propos de cette application.

source: &Help
fr: &Aide

source: Open
fr: Ouvrir

source: Open XSLT
fr: Ouvrir un fichier XSLT

source: Open a XSLT display file
fr: Ouvrir un fichier XSLT d'aperçu

source: Save
fr: Enregistre

source: Save the current file
fr: Enregistre le fichier en cours

source: Reload
fr: Ré-ouvre

source: Reload original file
fr: Ré-ouvre le fichier tel qu'il l'était lors du dernier enregistrement

source: XPath Expression
fr: Expression XPath

source: Search
fr: Recherche

source: Search.
fr: Recherche.

source: Ready
fr: Prêt

source: french translation
fr: traduction française

source: italian translation
fr: traduction italienne

source: Significations of the diff icons
fr: Signification des icônes

source: Diff status
fr: Etat de comparaison

source: is added in the second file (not present in the first)
fr: est ajouté dans le second fichier (absent dans le premier)

source: is removed in the second file (present in the first)
fr: est supprimé dans le second fichier (présent dans le premier)

source: has different values in the two files (modified)
fr: a des valeurs différentes dans les deux fichiers (modifié)

source: is a node with no differences, but differences exist on children nodes
fr: est un noeud qui n'est pas modifié lui-même, mais qui a des noeuds fils avec des différences

source: XML Elements
fr: Elements XML

source: is a standard Element (with no differences)
fr: est un élément XML classique (sans différences)

source: is a Text item (when displayed as nodes)
fr: est un élément Texte (lorsqu'affichés en tant que noeuds)

source: is an Attribute item (when displayed as nodes)
fr: est un attribut (lorsqu'affiché en noeud)

source: is a Comment node (when texts are displayed as nodes)
fr: est un commentaire (lorsqu'affiché en noeuds)

source: is the Root element of the XML File (may be hidden)
fr: est la racine XML du fichier (souvent masqué)

source: is an other type of node
fr: est un autre type de noeud

source: XPath Help
fr: Aide XPath

source: <html><body>Simple XPath search expression :<br/> - <code>*</code> : all childen nodes<br/> - <code>//*</code> : all nodes of the document<br/> - <code>//mynode</code> : all nodes of the document named <code>mynode</code><br/> - <code>//parent/mynode</code> : all nodes of the document named <code>mynode</code> and a parent <code>parent</code><br/> - <code>//*[@myattr]</code> : all nodes of the document with an attribute named <code>myattr</code><br/> - <code>//*[@myattr='toto']</code> : all nodes of the document with an attribute named <code>myattr</code> with value <code>toto</code><br/> - <code>//*[text()='toto']</code> : all nodes of the document with text content<code>toto</code><br/><br/>More advanced XPath references and tutorial :<br/> - <a href='https://www.w3.org/TR/xpath/'>XPath Specification</a><br/> - <a href='https://openclassrooms.com/courses/structurez-vos-donnees-avec-xml/xpath-localiser-les-donnees'>XPath tutorial [fr]</a><br/> - <a href='http://zvon.org/xxl/XPathTutorial/Output_fre/examples.html'>XPath examples [en]</a><br/> - <a href='http://www.tutorialspoint.com/xpath/'>XPath Tutorial [en]</a><br/> - <a href='http://www.w3schools.com/xml/xpath_intro.asp'>XPath Tutorial (w3schools) [en]</a><br/></body></html>
fr: <html><body>Expressions XPath simples :<br/> - <code>*</code> : tous les nœuds enfants<br/> - <code>//*</code> : tous les nœuds du document<br/> - <code>//mynode</code> : tous les nœuds du document appelés <code>mynode</code><br/> - <code>//parent/mynode</code> : tous les nœuds du document appelés <code>mynode</code> et de père <code>parent</code><br/> - <code>//*[@myattr]</code> : tous les nœuds du document avec un attribut nommé <code>myattr</code><br/> - <code>//*[@myattr='toto']</code> : tous les nœuds du document avec un attribut nommé <code>myattr</code> dont la valeur est <code>toto</code><br/> - <code>//*[text()='toto']</code> : tous les nœuds dont le texte est <code>toto</code><br/><br/>Tutoriels et références XPath :<br/> - <a href='https://www.w3.org/TR/xpath/'>Spécification XPath </a><br/> - <a href='https://openclassrooms.com/courses/structurez-vos-donnees-avec-xml/xpath-localiser-les-donnees'>Tutoriel XPath [fr]</a><br/> - <a href='http://zvon.org/xxl/XPathTutorial/Output_fre/examples.html'>Exemples XPath [en]</a><br/> - <a href='http://www.tutorialspoint.com/xpath/'>Tutoriel Path [en]</a><br/> - <a href='http://www.w3schools.com/xml/xpath_intro.asp'>Tutoriel XPath (w3schools) [en]</a><br/></body></html>

source: No file to save
fr: Aucun fichier à enregistrer

source: Save a file
fr: Enregistre le fichier

source: Open a Local Display XSLT file
fr: Ouvre un fichier XSLT d'aperçu

source: Open a HTML Display XSLT file
fr: Ouvre un fichier XSLT d'aperçu HTML

source: Diff two XML File
fr: Compare deux fichiers XML

source: Unexpected error while getting the string.
fr: Erreur inattendue lors de la récupération du message.

source: XPath Expression search :
fr: Expression XPath à chercher :

source: XPath Search
fr: Recherche XPath

source: &Custom Displays
fr: &Affichages personnalisés

source: List of custom display in your configuration file.
fr: Liste des affichages personnalisés dans votre fichier de configuration.

source: Open Local XSLT Display with file %s
fr: Ouvre un fichier XSLT avec le fichier %s

source: Open HTML XSLT Display with file %s
fr: Ouvre un fichier XSLT avec le fichier %s

source: Error while Loading the file %s
fr: Erreur lors du chargement du fichier %s

source: Parsing Before file OK : %ld nodes
fr: Lecture du fichier Avant OK : %ld noeuds

source: Parsing After file OK : %ld nodes
fr: Lecture du fichier Après OK : %ld noeuds

source: Diff OK : %ld nodes processed
fr: Comparaison OK : %ld noeuds traités

source: Diff in progress... (%d%%)
fr: Comparaison en cours... (%d%%)

source: Unable to instanciate stuctures, probably due to a memory problem
fr: Impossible de créer une structure, sans doute faute de mémoire

source: Error while diffing the files.
fr: Erreur lors de la comparaison des fichiers.

source: Invalid selected node.
fr: Noeud sélectionné invalide.

source: Unable to create the structure. Memory may be full.
fr: Impossible de créer une structure. Mémoire sans doute pleine.

source: XPath query error.
fr: Erreur lors de la requête XPath.

source: Node %d of %d found (%s)
fr: Noeud %d sur %d noeuds trouvés (%s).

source: No nodes found :
fr: Aucun noeud trouvé :

source: About %s
fr: A propos de %s

source: Translators
fr: Traducteurs

source: Display only added
fr: Afficher seulement les noeuds ajoutés

source: Display only removed
fr: Afficher seulement les nœuds supprimés

source: Display only added or removed
fr: Afficher seulement les nœuds ajoutés ou supprimés

source: Display only added, removed or equal
fr: Afficher seulement ajouté, enlevé ou égal

source: Display HTML Lists of differences
fr: HTML - Affiche les différences en listes

source: All Nodes
fr: Tous les nœuds

source: All Nodes named nodeName
fr: Tous les nœuds nodeName

source: All Nodes named nodeName with parent parent
fr: Tous les nœuds nodeName ayant comme père parent

source: All Nodes with attribute named attributeName
fr: Tous les nœuds ayant un attribut attributeName

source: All Nodes with attribute named attributeName with value toto
fr: Tous les nœuds avec un attribut attributeName ayant comme valeur toto

source: All Nodes with content text toto
fr: Tous les nœuds dont le contenu est le texte toto

source: Added Nodes
fr: Nœuds ajoutés
