Repository: rpeyron/xmltreenav
Catalog: po/xmlTreeNav.po
Languages: it

source: Apply
it: OK

source: Cancel
it: Annulla

source: XSLT Local Display File to use
it: File locale XSLT visualizzazione da usare

source: XSLT HTML Display File to use
it: File locale XSLT HTML visualizzazione da usare

source: Config File to use
it: File configurazione da usare

source: XML File to open
it: File XML da aprire

source: Performs efficient XML tree navigation and diff XML files.
it: Permette una veloce navigazione nella struttura dei file XML e la loro comparazione.

source: XML Files (*.xml)|*.xml|All files (*.*)|*.*
it: File XML (*.xml)|*.xml|Tutti file (*.*)|*.*

source: XSL Files (*.xsl;*.xslt)|*.xsl;*.xslt|All files (*.*)|*.*
it: File XSL (*.xsl;*.xslt)|*.xsl;*.xslt|Tutti i file (*.*)|*.*

source: This function is not yet implemented, or is being developped.
it: Questa funzione non è ancora stata implementata, o è in sviluppo.

source: Function not implemented.
it: Funzione non implementata.

source: Diff Options
it: Opzioni comparazione

source: xmlDiff current file
it: Compara il file XML aperto con questo file

source: With
it: Con

source: ...as Before file
it: come 1. file

source: ... as After file
it: come 2. file

source: Identifiers
it: Identificatori

source: Ignore Tags
it: Ignora tag

source: Add before values
it: Aggiungi prima del valore

source: Separator
it: Separatore

source: Tag Childs
it: Tag relativi

source: &Diff !
it: &Compara!

source: &Cancel
it: &Annulla

source: Diff to current XML File
it: Compara con il file XML attuale

source: Diff the currently opened XML file with this file.
it: Compara il file XML aperto con questo file.

source: Use the file specified above as before file, and the currently opened file as after file.
it: Usa il file specificato sopra come primo file, e il file attualmente aperto come secondo file.

source: Use the file specified above as after file, and the currently opened file as before file.
it: Usa il file specificato sopra come secondo file, e il file attualmente aperto come primo file.

source: Use these items as identifiers. (List of items separated by comma, attributes must be prefixed by @, and '.' can be used for the text)
it: Usa questi elementi come identificatori (elenco di elementi separati da virgola, gli attributi devono essere prefissati da @, e '.' possono essere usati per il testo)

source: Differences on these items will be ignored
it: Le differenze di questi elementi verranno ignorate

source: If checked, when a difference occurs, the output file will contain "before value <separator> after value"
it: Se selezionata, quando c'è una differenza, il file destinazione conterrà "valore precedente <separatore> valore successivo"

source: Text to separate before and after values
it: Testo di separazione prima e dopo i valori

source: Recursively tag childs of added or deleted nodes.
it: Tag relativi ricorsivi dei nodi aggiunti o eliminati.

source: Open a file
it: Apri un file

source: XML File With '%s' does not exist
it: Il file XML con '%s' non esiste

source: xmlDiff two files
it: Compara due file XML

source: Before
it: 1. file

source: After
it: 2. file

source: Diff Two XML Files
it: Comparazione di due file XML

source: XML File Before '%s' does not exist
it: Il file XML prima di '%s' non esiste

source: XML File After '%s' does not exist
it: Il file XML dopo '%s' non esiste

source: Preferences
it: Impostazioni

source: Clean Text
it: Azzeramento testo

source: Enforce Cleaning
it: Pulizia forzata

source: Pretty Print on Save
it: Stampa veloce al salvataggio

source: Engine
it: Motore

source: Optimize Memory usage
it: Ottimizza uso memoria

source: Use EXSLT
it: Usa EXSLT

source: Config
it: Varie

source: Configuration File
it: File configurazione

source: Search Size
it: Dimensione ricerca

source: Diff Defaults
it: Predefiniti differenze

source: Identifiers
it: Identificatori

source: Separator
it: Separatore

source: Tag childs
it: Tag relativi

source: Special Node Ids
it: ID nodi speciali

source: Special Nodes Before Value
it: Valore prima nodi speciali

source: &Open...
it: &Apri...

source: Open a file.
it: Apre un file.

source: &Open and Diff...
it: Apri e c&ompara...

source: Open and diff two XML files.
it: Apre e compara due file XML.

source: &Save
it: &Salva

source: Save the current file.
it: Salva il file attuale.

source: &Save as...
it: &Salva come...

source: Save the current file under another name.
it: Salva il file attuale con un nome diverso.

source: &Reload
it: &Ricarica file

source: Reload original file.
it: Ricarica il file originale.

source: &Preferences
it: &Impostazioni

source: Define application's settings.
it: Configura le impostazioni dell'applicazione.

source: &Quit
it: &Esci

source: Quit the application.
it: Esce dall'applicazione.

source: &Copy
it: &Copia

source: Copy current node to clipboard.
it: Copia il nodo attuale negli Appunti.

source: &Paste
it: &Incolla

source: Paste to file.
it: Incolla nel file.

source: &Search...
it: &Cerca...

source: Search nodes with XPath expression.
it: Cerca nodi con espressione XPath.

source: &Next
it: &Successivo

source: Next node of the previous search.
it: Nodo successivo della ricerca precedente.

source: &Expand All
it: &Espandi tutto

source: Expand all nodes of selected item.
it: Espande tutti i nodi degli elementi selezionati.

source: Co&llapse All
it: &Riduci tutto

source: Collapse all nodes of selected item.
it: Riduce tutti i nodi degli elementi selezionati.

source: &Edit
it: &Modifica

source: &Normal
it: Visualizzazione &normale

source: Normal display, with attributes and text inline.
it: Visualizzazione normale, con attributi e testo in linea.

source: &Texts
it: Visualizza solo &testo

source: Display with attributes inline, and texts as elements.
it: Visualizza con attributi relativi, e testo come elementi.

source: &Full
it: Visualizza &tutti gli elementi

source: Display everything as elements.
it: Visualizza qualsiasi cosa come elemento.

source: &Open Local XSLT Display...
it: &Apri file locale XSLT HTML...

source: Open a XSLT Local Display file.
it: Apre un file locale visualizzazione XSLT.

source: &Open HTML XSLT Display...
it: &Apri visualizzazione XSLT HTML...

source: Open a XSLT HTML Display file.
it: Apre un file visualizzazione XSLT HTML.

source: &Display
it: &Visualizza

source: &Diff to...
it: &Compara con il file...

source: Diff current XML file to another file.
it: Compara il file XML attuale con un altro file.

source: &Show differences
it: Vi&sualizza differenze come icone colorate

source: Highlight differents elements.
it: Evidenzia elementi differenti.

source: Show &only differences
it: Visualizza s&olo le differenze

source: Show only elements with differences.
it: Visualizza solo elementi differenti.

source: &Diff
it: &Compara

source: Help...
it: Guida in linea...

source: Main help file.
it: File principale Guida in linea.

source: Diff &icon's significations...
it: Significato icone differenze...

source: Explains diff icons.
it: Visualizza significato differenti icone.

source: Quick &XPath reference...
it: Guida in linea rapida &XPath...

source: XPath reference URLs.
it: URL riferimento XPath.

source: &About...
it: &Info sul programma...

source: About this application.
it: Info su questo programma.

source: &Help
it: &Guida in linea

source: Open
it: Apri

source: Open XSLT
it: Apri XSLT

source: Open a XSLT display file
it: Apri un file visualizzazione XSLT

source: Save
it: Salva

source: Save the current file
it: Salva il file attuale

source: Reload
it: Ricarica file

source: Reload original file
it: Ricarica il file originale

source: XPath Expression
it: Espressione XPath

source: Search
it: Cerca

source: Search.
it: Cerca.

source: Ready
it: Pronto

source: french translation
it: traduzione francese

source: italian translation
it: traduzione italiana

source: Significations of the diff icons
it: Significato icone delle differenze

source: Diff status
it: Stato differenze

source: is added in the second file (not present in the first)
it: è presente solo nel secondo file (non è presente nel primo)

source: is removed in the second file (present in the first)
it: non è presente nel secondo file (è presente solo nel primo)

source: has different values in the two files (modified)
it: hanno differenti valori nei due file (modificati)

source: is a node with no differences, but differences exist on children nodes
it: è un nodo senza differenze, la differenza esiste nel nodo figlio

source: XML Elements
it: Elementi XML

source: is a standard Element (with no differences)
it: è un elemento standard (senza differenze)

source: is a Text item (when displayed as nodes)
it: è un elementoi testo (quando sono visualizzati come nodi)

source: is an Attribute item (when displayed as nodes)
it: è un elemento attributo (quando sono visualizzati come nodi)

source: is a Comment node (when texts are displayed as nodes)
it: è un nodo commento (quando i testi sono visualizzati come nodi)

source: is the Root element of the XML File (may be hidden)
it: è l'elemento principale del file XML (può essere nascosto)

source: is an other type of node
it: è un altro tipo di nodo

source: XPath Help
it: Guida in linea XPath

source: <html><body>Simple XPath search expression :<br/> - <code>*</code> : all childen nodes<br/> - <code>//*</code> : all nodes of the document<br/> - <code>//mynode</code> : all nodes of the document named <code>mynode</code><br/> - <code>//parent/mynode</code> : all nodes of the document named <code>mynode</code> and a parent <code>parent</code><br/> - <code>//*[@myattr]</code> : all nodes of the document with an attribute named <code>myattr</code><br/> - <code>//*[@myattr='toto']</code> : all nodes of the document with an attribute named <code>myattr</code> with value <code>toto</code><br/> - <code>//*[text()='toto']</code> : all nodes of the document with text content<code>toto</code><br/><br/>More advanced XPath references and tutorial :<br/> - <a href='https://www.w3.org/TR/xpath/'>XPath Specification</a><br/> - <a href='https://openclassrooms.com/courses/structurez-vos-donnees-avec-xml/xpath-localiser-les-donnees'>XPath tutorial [fr]</a><br/> - <a href='http://zvon.org/xxl/XPathTutorial/Output_fre/examples.html'>XPath examples [en]</a><br/> - <a href='http://www.tutorialspoint.com/xpath/'>XPath Tutorial [en]</a><br/> - <a href='http://www.w3schools.com/xml/xpath_intro.asp'>XPath Tutorial (w3schools) [en]</a><br/></body></html>
it: <html><body>Ricerca espressione semplice XPath :<br/> - <code>*</code> : tutti i nodi figli<br/> - <code>//*</code> : tutti i nodi del documento<br/> - <code>//MioNodo</code> : tutti i nodi del documento nominati <code>MioNodo</code><br/> - <code>//Genitore/MioNodo</code> : tutti i moduli del documento nominati <code>MioNodo</code> e un genitore <code>Genitore</code><br/> - <code>//*[@NomeAttributo]</code> : tutti i nodi del documento con un attributo <code>NomeAttributo</code><br/> - <code>//*[@ValoreAttributo='NomeAttributo']</code> : tutti i nodi del documento con un attributo <code>ValoreAttributo</code> con un valore <code>ValoreAttributo</code><br/> - <code>//*[text()='ValoreTesto']</code> : tutti i nodi del documento contenenti un testo <code>ValoreTesto</code><br/><br/>Altri riferimenti avanzati e tutorial XPath :<br/> - <a href='https://www.w3.org/TR/xpath/'>Specifiche XPath</a><br/> - <a href='https://openclassrooms.com/courses/structurez-vos-donnees-avec-xml/xpath-localiser-les-donnees'>Tutorial XPath [fr]</a><br/> - <a href='http://zvon.org/xxl/XPathTutorial/Output_fre/examples.html'>Esempi XPath [en]</a><br/> - <a href='http://www.tutorialspoint.com/xpath/'>Tutorial XPath [en]</a><br/> - <a href='http://www.w3schools.com/xml/xpath_intro.asp'>Tutorial XPath (w3schools) [en]</a><br/></body></html>

source: No file to save
it: Nessun file da salvare

source: Save a file
it: Salva in un file

source: Open a Local Display XSLT file
it: Apri un file locale visualizzazione XSLT

source: Open a HTML Display XSLT file
it: Apri un file visualizzazione XSLT HTML

source: Diff two XML File
it: Comparazione di due file XML

source: Unexpected error while getting the string.
it: Errore inaspettato durante l'ottenimento stringa.

source: XPath Expression search :
it: Espressione XPath da cercare:

source: XPath Search
it: Ricerca XPath

source: &Custom Displays
it: &Visualizzazione personalizzata

source: List of custom display in your configuration file.
it: Elementi visualizzazione personalizzata nel file configurazione.

source: Open Local XSLT Display with file %s
it: Apri il file locale XSLT con il file %s

source: Open HTML XSLT Display with file %s
it: Apri visualizzazione XSLT HTML con il file %s

source: Error while Loading the file %s
it: Errore durante il caricamento del file %s

source: Parsing Before file OK : %ld nodes
it: Analisi prima di file OK : %ld nodi

source: Parsing After file OK : %ld nodes
it: Analisi dopo di file OK : %ld nodi

source: Diff OK : %ld nodes processed
it: Comparazione OK : %ld nodi elaborati

source: Diff in progress... (%d%%)
it: Comparazione... (%d%%)

source: Unable to instanciate stuctures, probably due to a memory problem
it: Impossibile creare la struttura, probabilmente a causa di problemi di memoria

source: Error while diffing the files.
it: Errore durante la comparazione dei file.

source: Invalid selected node.
it: Nodo selezione non valido.

source: Unable to create the structure. Memory may be full.
it: Impossibile creare la struttura. La memoria potrebbe essere esaurita.

source: XPath query error.
it: Errore richiesta Xpath.

source: Node %d of %d found (%s)
it: Trovati nodo %d di %d nodi (%s).

source: No nodes found :
it: Nessun nodo trovato:

source: About %s
it: Informazioni su %s

source: Translators
it: Traduttori

source: Display only added
it: Visualizza solo aggiunte

source: Display only removed
it: Visualizza solo rimosse

source: Display only added or removed
it: Visualizza solo aggiunte o rimosse

source: Display only added, removed or equal
it: Visualizza solo aggiunte, rimosse o uguali

source: Display HTML Lists of differences
it: Visualizza elenco HTML differenze

source: All Nodes
it: Tutti i nodi

source: All Nodes named nodeName
it: Tutti i nodi nominati NomeNodo

source: All Nodes named nodeName with parent parent
it: Tutti i nomi nominati NomeNodo con genitori

source: All Nodes with attribute named attributeName
it: Tutti i nodi con attributo NomeAttributo

source: All Nodes with attribute named attributeName with value toto
it: Tutti i nodi con attributo NomeAttributo con valore xxxx

source: All Nodes with content text toto
it: Tutti i nodi contenetti il testo xxxx

source: Added Nodes
it: Nodi aggiunti
